Repository: amarnaud2/revalidate-for-vercel
Catalog: languages/vercel-revalidate-*.po
Languages: fr_fr

source: About
fr_fr: À propos

source: About Vercel Revalidate
fr_fr: À propos de Vercel Revalidate

source: This plugin allows your WordPress site to trigger Incremental Static Regeneration (ISR) on a Next.js frontend hosted on Vercel, each time a post is updated.
fr_fr: Ce plugin permet à votre site WordPress de déclencher une régénération statique incrémentielle (ISR) sur un frontend Next.js hébergé sur Vercel, à chaque fois qu’un article est mis à jour.

source: It supports admin configuration, manual testing, logging, email alerts on failure, and CSV export.
fr_fr: Il prend en charge la configuration de l’administrateur, les tests manuels, la journalisation, les alertes par e-mail en cas d’échec et l’exportation CSV.

source: Developed by
fr_fr: Développé par

source: Revalidation Logs
fr_fr: Journaux de revalidation

source: Logs
fr_fr: Journaux

source: Time
fr_fr: Heure

source: Slug
fr_fr: Identifiant

source: Status
fr_fr: Statut

source: Clear Logs
fr_fr: Supprimer le journal d'erreurs

source: Export as CSV
fr_fr: ﻿Exporter en tant que CSV

source: No logs recorded yet.
fr_fr: Aucun journal n’a encore été enregistré.

source: Revalidation triggered for
fr_fr: Revalidation déclenchée pour

source: Error
fr_fr: Erreur

source: Success
fr_fr: Succès

source: Frequently Asked Questions
fr_fr: Questions fréquentes

source: Do I need to use Vercel?
fr_fr: Dois-je utiliser Vercel ?

source: Yes. This plugin is specifically designed for websites using Next.js hosted on Vercel.
fr_fr: Oui. Ce plugin est spécialement conçu pour les sites web utilisant des Next.js hébergés sur Vercel.

source: Is it compatible with all WordPress themes?
fr_fr: Est-il compatible avec tous les thèmes WordPress ?

source: Yes, it works with all themes. The plugin runs in the background and does not affect theme behavior.
fr_fr: Oui, il fonctionne avec tous les thèmes. Le plugin fonctionne en arrière-plan et n’affecte pas le comportement du thème.

source: How do I secure my revalidation endpoint?
fr_fr: Comment puis-je sécuriser mon point de terminaison de revalidation ?

source: Always use a secret token and configure it in both this plugin and your Next.js API route.
fr_fr: Utilisez toujours un jeton secret et configurez-le à la fois dans ce plugin et dans votre Next.js route API.

source: 🔒 This plugin uses HMAC signature validation by default.
fr_fr: 🔒 Ce plugin utilise par défaut une validation de signature HMAC.

source: All revalidation requests are cryptographically signed to ensure they are authentic and tamper-proof. Your secret key is never exposed in the URL — only a hashed version is transmitted. This protects your Next.js site from unauthorized invalidation attempts.
fr_fr: Toutes les requêtes de revalidation sont signées de manière cryptographique afin de garantir leur authenticité. Votre clé secrète n’est jamais transmise dans l’URL — seule sa version hachée est envoyée. Cela protège votre site Next.js des tentatives non autorisées.

source: ⚠️ Important note about Edge Functions (App Router)
fr_fr: ⚠️ Remarque importante concernant les fonctions Edge (App Router)

source: If your revalidation endpoint is deployed as an Edge Function (e.g. using the App Router in edge runtime mode), the native Node.js crypto module may not be available.
fr_fr: Si votre endpoint de revalidation est déployé sous forme de fonction Edge (par exemple en App Router avec le runtime Edge), le module crypto de Node.js peut ne pas être disponible.

source: In that case, use the Web Crypto API instead to validate the HMAC signature.
fr_fr: Dans ce cas, utilisez plutôt l’API Web Crypto pour valider la signature HMAC.

source: Enter the full public URL of your revalidate endpoint. Example: https://yoursite.com/api/revalidate
fr_fr: Entrez l’URL publique complète de votre point de terminaison de revalidation. Exemple : https://yoursite.com/api/revalidate
